"""
Написать функцию проверяющею интернет соединение, наличее всех папок, работает ли сайт HH и SJ
"""
def CheckEngine():
    print("Вру врум")


a = input("a --- ")
b = input("b ---")
print(a, b)
print(type(a), type(b))